cruzerngz/MDP_STM32/stm32/Core/Src/uart_state_machine.c
/*
 * uart_state_machine.c
 *
 *  Created on: Sep 7, 2022
 *      Author: Jiarui.Ng
 */

#include "stdbool.h"

#include "uart_state_machine.h"
#include "uart_state_machine_api.h"
#include "globals.h"

// disable when unit testing
#ifndef UNITTEST
#include "stm32f4xx_hal.h" // temp include, for debugging
#include "move.h"
#endif

// Returns the number of elements in the array
#define ARRAY_LEN(_array_) (sizeof(_array_) / sizeof(_array_[0]))

// Offset to convert an ascii char (as uint8_t) to an int val
#define ASCII_OFFSET 48


/* EXTERN GLOBALS */

// flags polled by main to check for any command to execute
// reset by main task, no need to be reset here
volatile uint16_t 						FLAG_MOVEMENT_DISTANCE = 0;
volatile uint16_t 						FLAG_TURN_ANGLE = 0;
volatile uint8_t 						FLAG_IN_PLACE_CARDINAL = 0;
volatile int8_t 						FLAG_APPROACH_OBSTACLE =  0;

// additional flags used by move/turn, requires reset
volatile int8_t 						FLAG_MOVE_DIR = 0; // forward/backward, +1 or -1 only
volatile int8_t 						FLAG_TURN_DIR = 0; // right/left, +1 or -1 only

// flags used by config, initialised to be the values defined in move.h
// used to store the defaults if a reset is needed
// volatile int16_t                        FLAG_KP = MOVE_KP;
// volatile int16_t                        FLAG_KI = MOVE_KI;
// volatile int16_t                        FLAG_KD = MOVE_KD;
// volatile int16_t                        FLAG_DEFAULT_SPEED_STRAIGHT = MOVE_DEFAULT_SPEED_STRAIGHT_MM_S;
// volatile int16_t                        FLAG_DEFAULT_SPEED_TURN = MOVE_DEFAULT_SPEED_TURN_MM_S;

// flags used for high speed
volatile bool                    FLAG_CHANGE_LANE = 0;
volatile bool                    FLAG_CHANGE_BIG_LANE = 0;
volatile bool                    FLAG_U_TURN = 0;
volatile int8_t                  FLAG_SWITCH_DIR = 0; // right/left, +1 or -1 only


/* STATIC GLOBALS */
// Some globals are not static for extern unit tests to access them

// default drive mode
static volatile StateMachineDriveMode 	GLOBAL_DRIVE_MODE = StateMachineModeSelect;

// default starting mode for high speed
static volatile SpeedStates            GLOBAL_SPEED_MODE = SpeedIdle;
// static volatile bool                   GLOBAL_SPEED_MODE_IS_RESET = 1; // 1 if input contains '\s', to distinguish between substate and command with same input
// static volatile bool                   GLOBAL_SPEED_MODE_IS_PREFIX_SET = 0; // whether \s was sent previously

// default starting mode for fine control
static volatile ConfigStates            GLOBAL_CONFIG_MODE = ConfigIdle;
static volatile ConfigStates            GLOBAL_CONFIG_SUB_MODE = ConfigIdle;

// static
volatile int16_t 						GLOBAL_CONFIG_MAGNITUDE = 0; // param that sets the flags after interrupt
static volatile bool 					GLOBAL_CONFIG_INGEST = false;

// set to 0 or a value from move.h ?
// volatile int16_t                        GLOBAL_CONFIG_KP = MOVE_KP;
// volatile int16_t                        GLOBAL_CONFIG_KI = MOVE_KI;
// volatile int16_t                        GLOBAL_CONFIG_KD = MOVE_KD;

// volatile int16_t                        GLOBAL_CONFIG_DEFAULT_SPEED_STRAIGHT = MOVE_DEFAULT_SPEED_STRAIGHT_MM_S;
// volatile int16_t                        GLOBAL_CONFIG_DEFAULT_SPEED_TURN = MOVE_DEFAULT_SPEED_TURN_MM_S;

// default starting mode for fine control
static volatile FineControlStates 		GLOBAL_FINE_CONTROL_MODE = FineControlIdle;

// static
volatile int16_t 						GLOBAL_FINE_CONTROL_MAGNITUDE = 0; // param that sets the flags after interrupt
// +1 for right, -1 for left
volatile int8_t  						GLOBAL_FINE_CONTROL_TURN_DIR = 0;
// +1 for forward, -1 for backward
volatile int8_t 						GLOBAL_FINE_CONTROL_MOVE_DIR = 0;
static volatile bool 					GLOBAL_FINE_CONTROL_ACCEPT_TURN_MOVE = false;
static volatile bool 					GLOBAL_FINE_CONTROL_INGEST = false;

// default starting modes for toy car
static volatile ToyCarStates 			GLOBAL_TOY_CAR_MODE = ToyCarDrive;
static volatile ToyCarMoveCommands 		GLOBAL_TOY_CAR_MODE_MODIFIER;

#ifndef UNITTEST
static MotorSpeed 						VALID_SPEEDS[] = {MotorSpeed1, MotorSpeed2, MotorSpeed3};
static ServoMagnitude 					VALID_DIRS[] = {ServoMag1, ServoMag2, ServoMag3, ServoMag4, ServoMag5, ServoMag6};

static volatile MotorSpeed 				GLOBAL_TOY_CAR_SPEED = MotorSpeed1;
static volatile ServoMagnitude 			GLOBAL_TOY_CAR_DIR = ServoMag1;
#endif

// sub-states and their respective interpreters

uint8_t _state_machine_mode_interpreter(uint8_t command);

uint8_t _high_speed_interpreter(uint8_t command);
uint8_t _high_speed_interpreter_idle(uint8_t command);
uint8_t _high_speed_interpreter_boolean(uint8_t command);
void _high_speed_reset_intern_flags(void);
void _high_speed_reset_extern_flags(void);

uint8_t _config_interpreter(uint8_t command);
uint8_t _config_interpreter_idle(uint8_t command);
uint8_t _config_interpreter_magnitude(uint8_t command);
uint8_t _config_interpreter_boolean(uint8_t command);
uint8_t _config_interpreter_ingest_magnitude(uint8_t command);

uint8_t _config_set_flags(void);
void _config_reset_intern_flags(void);
// void _config_reset_extern_flags(void);


uint8_t _fine_control_interpreter(uint8_t command);
uint8_t _fine_control_interpreter_idle(uint8_t command);
uint8_t _fine_control_interpreter_move(uint8_t command);
uint8_t _fine_control_interpreter_turn(uint8_t command);
uint8_t _fine_control_interpreter_turn_dir(uint8_t command);
uint8_t _fine_control_interpreter_ingest_magnitude(uint8_t command);

void _fine_control_reset_intern_flags(void);
void _fine_control_reset_extern_flags(void);
uint8_t _fine_control_set_flags(void);


uint8_t _toy_car_interpreter(uint8_t command);
uint8_t _toy_car_interpreter_drive(uint8_t command);
uint8_t _toy_car_interpreter_setting(uint8_t command);
uint8_t _toy_car_interpreter_custom(uint8_t command);
//uint8_t _toy_car_interpreter_modifier(uint8_t command);


/**
 * Main entry point to the state machine.
 * Ingests a single char from UART
 * and modifies its internal state if command is valid
 * State change -> changes in car behavior
 */
uint8_t state_machine_interpreter(uint8_t command) {
	if(command == StateMachineModeSelect) {
		GLOBAL_DRIVE_MODE = StateMachineModeSelect;
		return StateMachineFullAck;
	}

	switch(GLOBAL_DRIVE_MODE) {
    case StateMachineSpeed:
        return _high_speed_interpreter(command);
        break;

	case StateMachineFineControl:
		return _fine_control_interpreter(command);
		break;

	case StateMachineToyCar:
		#ifndef UNITTEST
			return _toy_car_interpreter(command);
		#else
			return StateMachineUnknown;
		#endif
		break;

    case StateMachineConfig:
		return _config_interpreter(command);
		break;

	case StateMachineModeSelect:
		return _state_machine_mode_interpreter(command);
		break;

	default:
		GLOBAL_DRIVE_MODE = StateMachineToyCar;
		return StateMachineUnknown;
	}

	return StateMachineUnknown;
}

uint8_t _state_machine_mode_interpreter(uint8_t command) {
	switch(command) {
    case StateMachineSpeed:
		GLOBAL_DRIVE_MODE = StateMachineSpeed;
        // GLOBAL_SPEED_MODE_IS_RESET = 1; // dont keep track of GLOBAL_SPEED_MODE state
		return StateMachineFullAck;
		break;

    case StateMachineConfig:
		GLOBAL_DRIVE_MODE = StateMachineConfig;
		return StateMachineFullAck;
		break;

	case StateMachineFineControl:
		GLOBAL_DRIVE_MODE = StateMachineFineControl;
		return StateMachineFullAck;
		break;

	case StateMachineToyCar:
		GLOBAL_DRIVE_MODE = StateMachineToyCar;
		return StateMachineFullAck;
		break;

	case StateMachineModeSelect:
		GLOBAL_DRIVE_MODE = StateMachineModeSelect;
		return StateMachineFullAck;
		break;

	default:
		return StateMachineUnknown;
		break;
	}

	return StateMachineUnknown;
}

/**
 * Main entry point to the high speed state machine
 */
uint8_t _high_speed_interpreter(uint8_t command) {
    // if (GLOBAL_SPEED_MODE_IS_RESET) { // refresh GLOBAL_SPEED_MODE state
    //     GLOBAL_SPEED_MODE = SpeedIdle; 
    // }

