cruzerngz/MDP_STM32/stm32/Core/Src/uart_state_machine.c
    switch(GLOBAL_SPEED_MODE) {
	case SpeedIdle:
		return _high_speed_interpreter_idle(command);
		break;

    case SpeedLaneChange:
    case SpeedBigLaneChange:
    case SpeedUTurn:
        return _high_speed_interpreter_boolean(command);
        break;

	default:
		GLOBAL_SPEED_MODE = SpeedIdle;
		return StateMachineUnknown;
	}
}

uint8_t _high_speed_interpreter_idle(uint8_t command) {
	switch(command) {
	case SpeedLane:
        // at this point, all input are valid and at end of command
        // GLOBAL_SPEED_MODE_IS_RESET = 0; // now keep track of GLOBAL_SPEED_MODE state
		GLOBAL_SPEED_MODE = SpeedLaneChange;
		return StateMachinePartialAck;
		break;

	case SpeedBigLane:
        // GLOBAL_SPEED_MODE_IS_RESET = 0; 
		GLOBAL_SPEED_MODE = SpeedBigLaneChange;
		return StateMachinePartialAck;
		break;

	case SpeedUTurning:
        // GLOBAL_SPEED_MODE_IS_RESET = 0; 
		GLOBAL_SPEED_MODE = SpeedUTurn;
		return StateMachinePartialAck;
		break;

	default:
		GLOBAL_SPEED_MODE = SpeedIdle;
		return StateMachineUnknown;
		break;
	}
}

uint8_t _high_speed_interpreter_boolean(uint8_t command) {
    if (command != SpeedSwitchRight && command != SpeedSwitchLeft) {
        _high_speed_reset_intern_flags();
        return StateMachineUnknown;
    }

    switch(GLOBAL_SPEED_MODE) {
    case SpeedLaneChange:
        FLAG_CHANGE_LANE = 1;
        FLAG_SWITCH_DIR = (command == SpeedSwitchRight) ? 1 : -1;
        _high_speed_reset_intern_flags();
        return StateMachineFullAck;
        break;

    case SpeedBigLaneChange:
        FLAG_CHANGE_BIG_LANE = 1;
        FLAG_SWITCH_DIR = (command == SpeedSwitchRight) ? 1 : -1;
        _high_speed_reset_intern_flags();
        return StateMachineFullAck;
        break;

    case SpeedUTurn:
        FLAG_U_TURN = 1;
        FLAG_SWITCH_DIR = (command == SpeedSwitchRight) ? 1 : -1;
        _high_speed_reset_intern_flags();
        return StateMachineFullAck;
        break;

    default: // fallback to idle state
        _high_speed_reset_intern_flags();
        return StateMachineUnknown;
        break;
	}
}


/**
 * @brief Resets all flags internal to defaults
 * Resets the high speed mode to idle
 *
 */
void _high_speed_reset_intern_flags(void) {
	GLOBAL_SPEED_MODE = SpeedIdle;
}

/**
 * @brief Resets all extern flags (FLAG_*) to defaults
 *
 */
void _high_speed_reset_extern_flags(void) {
    FLAG_CHANGE_LANE = 0;
    FLAG_CHANGE_BIG_LANE = 0;
    FLAG_U_TURN = 0;
    FLAG_SWITCH_DIR = 0;
}


/**
 * Main entry point to the config state machine
 */
uint8_t _config_interpreter(uint8_t command) {
	switch(GLOBAL_CONFIG_MODE) {
	case ConfigIdle:
		return _config_interpreter_idle(command);
		break;

	case ConfigPID: // go to substate
    case ConfigDefaultSpeed:
		return _config_interpreter_magnitude(command);
		break;

    case ConfigLowGripFlag:
		return _config_interpreter_boolean(command);
		break;

	default:
		GLOBAL_FINE_CONTROL_MODE = ConfigIdle;
		return StateMachineUnknown;
	}
}

uint8_t _config_interpreter_idle(uint8_t command) {
	switch(command) {
	case ConfigReset:
		GLOBAL_CONFIG_MODE = ConfigIdle;
        GLOBAL_CONFIG_SUB_MODE = ConfigIdle;
		GLOBAL_CONFIG_INGEST = false;
		GLOBAL_CONFIG_MAGNITUDE = 0; 		// reset
		return StateMachineFullAck;
		break;

	case ConfigK:
		GLOBAL_CONFIG_MODE = ConfigPID;
		return StateMachinePartialAck;
		break;

	case ConfigSpeed:
		GLOBAL_CONFIG_MODE = ConfigDefaultSpeed;
		return StateMachinePartialAck;
		break;

    case ConfigLowGrip:
		GLOBAL_CONFIG_MODE = ConfigLowGripFlag;
		return StateMachinePartialAck;
		break;

	default:
		GLOBAL_CONFIG_MODE = ConfigIdle;
		return StateMachineUnknown;
		break;
	}
}

uint8_t _config_interpreter_magnitude(uint8_t command) {
	if(GLOBAL_CONFIG_INGEST) {
		return _config_interpreter_ingest_magnitude(command);

	} else {
        // p, i, d, s, or t is sent in
        // need another global var to rmb if we are changing p, i, d, s, or t
        if (command == ConfigKp) GLOBAL_CONFIG_SUB_MODE = ConfigPIDKp;
        else if (command == ConfigKi) GLOBAL_CONFIG_SUB_MODE = ConfigPIDKi;
        else if (command == ConfigKd) GLOBAL_CONFIG_SUB_MODE = ConfigPIDKd;
        else if (command == ConfigSpeedStraight) GLOBAL_CONFIG_SUB_MODE = ConfigDefaultSpeedStraight;
        else if (command == ConfigSpeedTurn) GLOBAL_CONFIG_SUB_MODE = ConfigDefaultSpeedTurn;
        else {
            GLOBAL_CONFIG_MODE = ConfigIdle;
            GLOBAL_CONFIG_SUB_MODE = ConfigIdle;
            GLOBAL_CONFIG_INGEST = false;
            return StateMachineUnknown;
        }

        GLOBAL_CONFIG_INGEST = true;
        GLOBAL_CONFIG_MAGNITUDE = 0;
        return StateMachineInputField;
	}
}

uint8_t _config_interpreter_boolean(uint8_t command) {
    if (command == ConfigLowGripTrue) {
        _GLOBAL_MOVE_SURFACE_LOW_GRIP = true;
        return StateMachineFullAck;
    } 
    else if (command == ConfigLowGripFalse) {
        _GLOBAL_MOVE_SURFACE_LOW_GRIP = false;
        return StateMachineFullAck;
    } else { // fallback to idle state
		_config_reset_intern_flags();
		return StateMachineUnknown;
	}
}

uint8_t _config_interpreter_ingest_magnitude(uint8_t command) {
	uint8_t command_as_int = command - ASCII_OFFSET;
	uint8_t reply;

    // done giving value input
	if(command == StateMachineFullAck) {
		reply = _config_set_flags();
		_config_reset_intern_flags(); 

		return reply;
	}

	else if(command_as_int >= 0 && command_as_int <= 9 ) {
		GLOBAL_FINE_CONTROL_MAGNITUDE = (GLOBAL_FINE_CONTROL_MAGNITUDE * 10) + command_as_int;
		return StateMachineInputField;
		// continue with ingest

	} else { // fallback to idle state
		_config_reset_intern_flags();
		return StateMachineUnknown;
	}

	return StateMachineUnknown;
}

uint8_t _config_set_flags(void) {
	switch(GLOBAL_CONFIG_SUB_MODE) {
		case ConfigPIDKp:
            _GLOBAL_MOVE_KP = GLOBAL_CONFIG_MAGNITUDE;
			return StateMachineFullAck;
			break;

		case ConfigPIDKi:
            _GLOBAL_MOVE_KI = GLOBAL_CONFIG_MAGNITUDE;
			return StateMachineFullAck;
			break;

