cruzerngz/MDP_STM32/stm32/Core/Src/uart_state_machine.c
        case ConfigPIDKd:
            _GLOBAL_MOVE_KD = GLOBAL_CONFIG_MAGNITUDE;
			return StateMachineFullAck;
			break;

		case ConfigDefaultSpeedStraight:
            _GLOBAL_MOVE_DEFAULT_SPEED_STRAIGHT_MM_S = GLOBAL_CONFIG_MAGNITUDE;
			return StateMachineFullAck;
			break;

		case ConfigDefaultSpeedTurn:
            _GLOBAL_MOVE_DEFAULT_SPEED_TURN_MM_S = GLOBAL_CONFIG_MAGNITUDE;
			return StateMachineFullAck;
			break;

		default: // do nothing
			return StateMachineUnknown;
			break;
	}
}

/**
 * @brief Resets all flags internal to defaults
 * Resets the config mode and submode to idle
 *
 */
void _config_reset_intern_flags(void) {
	GLOBAL_CONFIG_MAGNITUDE = 0;
	GLOBAL_CONFIG_INGEST = false;

	GLOBAL_CONFIG_MODE = ConfigIdle;
	GLOBAL_CONFIG_SUB_MODE = ConfigIdle;
}

/**
 * @brief Resets all extern flags (FLAG_*) to defaults
 *
 */
// void _config_reset_extern_flags(void) {
// 	// FLAG_MOVE_DIR = 0;
// 	// FLAG_TURN_DIR = 0;
// 	// FLAG_MOVEMENT_DISTANCE = 0;
// 	// FLAG_TURN_ANGLE = 0;
// 	// FLAG_IN_PLACE_CARDINAL = 0;
// 	// FLAG_APPROACH_OBSTACLE = 0;
//     _GLOBAL_MOVE_KP = MOVE_KP;
//     _GLOBAL_MOVE_KI = MOVE_KI;
//     _GLOBAL_MOVE_KD = MOVE_KD;
//     _GLOBAL_MOVE_DEFAULT_SPEED_STRAIGHT_MM_S = MOVE_DEFAULT_SPEED_STRAIGHT_MM_S;
//     _GLOBAL_MOVE_DEFAULT_SPEED_TURN_MM_S = MOVE_DEFAULT_SPEED_TURN_MM_S;
// }



/**
 * Main entry point to the fine control state machine
 */
uint8_t _fine_control_interpreter(uint8_t command) {
	switch(GLOBAL_FINE_CONTROL_MODE) {
	case FineControlIdle:
		return _fine_control_interpreter_idle(command);
		break;

	case FineControlMove:
		return _fine_control_interpreter_move(command);
		break;

	case FineControlTurn:
		return _fine_control_interpreter_turn(command);
		break;

	case FineControlInPlaceTurn:
		return _fine_control_interpreter_ingest_magnitude(command);
		break;

	default:
		GLOBAL_FINE_CONTROL_MODE = FineControlIdle;
		return StateMachineUnknown;
	}
}

uint8_t _fine_control_interpreter_idle(uint8_t command) {
	switch(command) {
	case FineControlReset:
		GLOBAL_FINE_CONTROL_MODE = FineControlIdle;
		GLOBAL_FINE_CONTROL_INGEST = false;
		GLOBAL_FINE_CONTROL_MAGNITUDE = 0; 		// reset
		GLOBAL_FINE_CONTROL_TURN_DIR = 0; // reset
		return StateMachineFullAck;
		break;

	case FineControlMovement:
		GLOBAL_FINE_CONTROL_MODE = FineControlMove;
		return StateMachinePartialAck;
		break;

	case FineControlTurning:
		GLOBAL_FINE_CONTROL_MODE = FineControlTurn;
		return StateMachinePartialAck;
		break;

	case FineControlInPlaceTurning:
		GLOBAL_FINE_CONTROL_MODE = FineControlInPlaceTurn;
		GLOBAL_FINE_CONTROL_INGEST = true;
		return StateMachineInputField;
		break;

	case FineControlApproachObstacle:
		FLAG_APPROACH_OBSTACLE = 1;
		return StateMachineFullAck;
		break;

	default:
		GLOBAL_FINE_CONTROL_MODE = FineControlIdle;
		return StateMachineUnknown;
		break;
	}
}
uint8_t _fine_control_interpreter_move(uint8_t command) {
	if(GLOBAL_FINE_CONTROL_INGEST) { // set move dir, continue
		return _fine_control_interpreter_ingest_magnitude(command);

	} else { // move dir not set, to be set here
		if(command == FineControlMoveForward) GLOBAL_FINE_CONTROL_MOVE_DIR = 1;
		else if(command == FineControlMoveBackward) GLOBAL_FINE_CONTROL_MOVE_DIR = -1;
		else {
			GLOBAL_FINE_CONTROL_MODE = FineControlIdle;
			GLOBAL_FINE_CONTROL_INGEST = false;
			return StateMachineUnknown;
		}

		GLOBAL_FINE_CONTROL_INGEST = true;
		GLOBAL_FINE_CONTROL_MAGNITUDE = 0; // reset the value
		return StateMachineInputField;
	}
}

/**
 * @brief Handles setting of flags for turning
 *
 *
 * @param command
 * @return uint8_t
 */
uint8_t _fine_control_interpreter_turn(uint8_t command) {
	if(GLOBAL_FINE_CONTROL_INGEST) { // if ingesting numbers
		return _fine_control_interpreter_ingest_magnitude(command);
	}
	else if(GLOBAL_FINE_CONTROL_ACCEPT_TURN_MOVE) { // if taking in move dirrection
		return _fine_control_interpreter_turn_dir(command);
	}
	else {
		if(command == FineControlTurnRight) {
			GLOBAL_FINE_CONTROL_TURN_DIR = 1;
			GLOBAL_FINE_CONTROL_ACCEPT_TURN_MOVE = true;
			return StateMachinePartialAck;
		}
		else if(command == FineControlTurnLeft) {
			GLOBAL_FINE_CONTROL_TURN_DIR = -1;
			GLOBAL_FINE_CONTROL_ACCEPT_TURN_MOVE = true;
			return StateMachinePartialAck;
		}
		else {
			_fine_control_reset_intern_flags();
			return StateMachineUnknown;
		}
	}
}

/**
 * @brief Set the movement dir when turning (forward/backward)
 *
 * @param command
 * @return uint8_t
 */
uint8_t _fine_control_interpreter_turn_dir(uint8_t command) {
	switch(command) {
		case FineControlMoveForward:
			GLOBAL_FINE_CONTROL_MOVE_DIR = 1;
			GLOBAL_FINE_CONTROL_INGEST = true;
			return StateMachineInputField;
			break;

		case FineControlMoveBackward:
			GLOBAL_FINE_CONTROL_MOVE_DIR = -1;
			GLOBAL_FINE_CONTROL_INGEST = true;
			return StateMachineInputField;
			break;

		default:
			_fine_control_reset_intern_flags();
			return StateMachineUnknown;
			break;
	}
}

uint8_t _fine_control_interpreter_ingest_magnitude(uint8_t command) {
	uint8_t command_as_int = command - ASCII_OFFSET;
	uint8_t reply;

	if(command == StateMachineFullAck) {
		reply = _fine_control_set_flags();
		_fine_control_reset_intern_flags();

		return reply;
	}

	else if(command_as_int >= 0 && command_as_int <= 9 ) {
		GLOBAL_FINE_CONTROL_MAGNITUDE = (GLOBAL_FINE_CONTROL_MAGNITUDE * 10) + command_as_int;
		return StateMachineInputField;
		// continue with ingest

	} else { // fallback to idle state
		_fine_control_reset_intern_flags();
		return StateMachineUnknown;
	}

	return StateMachineUnknown;
}

/**
 * @brief Sets the various flags in fine control mode
 * Passes the values from statically scoped variables to extern variables
 *
 */
uint8_t _fine_control_set_flags(void) {
	switch(GLOBAL_FINE_CONTROL_MODE) {
		case FineControlMove:
			FLAG_MOVEMENT_DISTANCE = GLOBAL_FINE_CONTROL_MAGNITUDE;
			FLAG_MOVE_DIR = GLOBAL_FINE_CONTROL_MOVE_DIR;
			return StateMachineFullAck;
			break;

		case FineControlTurn:
			FLAG_TURN_ANGLE = GLOBAL_FINE_CONTROL_MAGNITUDE;
			FLAG_TURN_DIR = GLOBAL_FINE_CONTROL_TURN_DIR;
			FLAG_MOVE_DIR = GLOBAL_FINE_CONTROL_MOVE_DIR;
			return StateMachineFullAck;
			break;

		case FineControlInPlaceTurn:
			FLAG_IN_PLACE_CARDINAL = GLOBAL_FINE_CONTROL_MAGNITUDE;
			return StateMachineFullAck;
			break;

		default: // do nothing
			return StateMachineUnknown;
			break;
	}
}

/**
 * @brief Resets all flags internal to defaults
 * Resets the fine control mode to idle
 *
 */
void _fine_control_reset_intern_flags(void) {
	GLOBAL_FINE_CONTROL_MAGNITUDE = 0;
	GLOBAL_FINE_CONTROL_TURN_DIR = 0;
	GLOBAL_FINE_CONTROL_MOVE_DIR = 0;
	GLOBAL_FINE_CONTROL_ACCEPT_TURN_MOVE = false;
	GLOBAL_FINE_CONTROL_INGEST = false;

